{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "layers": [
        {
          "class_name": "LSTM",
          "config": {
            "units": 128,
            "input_shape": [10, 64], 
            "return_sequences": true
          }
        },
        {
          "class_name": "LSTM",
          "config": {
            "units": 64,
            "return_sequences": false
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 32,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1, 
            "activation": "linear"
          }
        }
      ]
    }
  },
  "trainingConfig": {
    "optimizer_config": {
      "class_name": "Adam",
      "config": {
        "learning_rate": 0.001
      }
    },
    "loss": "mean_squared_error",
    "metrics": ["accuracy"]
  },
  "weightsManifest": [
    {
      "paths": ["model-weights.bin"],
      "weights": [
    
        {
          "name": "lstm_1/kernel",
          "shape": [64, 512],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/recurrent_kernel",
          "shape": [128, 512],
          "dtype": "float32"
        },
        {
          "name": "lstm_1/bias",
          "shape": [512],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/kernel",
          "shape": [128, 256],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/recurrent_kernel",
          "shape": [64, 256],
          "dtype": "float32"
        },
        {
          "name": "lstm_2/bias",
          "shape": [256],
          "dtype": "float32"
        },
        {
          "name": "dense_1/kernel",
          "shape": [64, 32],
          "dtype": "float32"
        },
        {
          "name": "dense_1/bias",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "dense_2/kernel",
          "shape": [32, 1],
          "dtype": "float32"
        },
        {
          "name": "dense_2/bias",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
