{
    "class_name": "Sequential",
    "config": {
      "name": "sequential_model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 50,
            "activation": "relu",
            "name": "layer_1",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 100,
            "activation": "relu",
            "name": "layer_2",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 50,
            "activation": "relu",
            "name": "layer_3",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 25,
            "activation": "tanh",
            "name": "layer_4",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "trainable": true
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "linear",
            "name": "output_layer",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "trainable": true
          }
        }
      ]
    }
  }
  