{
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "layers": [
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 32,
              "kernel_size": [3, 3],
              "activation": "relu",
              "input_shape": [28, 28, 1],
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "filters": 64,
              "kernel_size": [3, 3],
              "activation": "relu",
              "padding": "same"
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "pool_size": [2, 2]
            }
          },
          {
            "class_name": "Flatten",
            "config": {}
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 128,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "units": 10,
              "activation": "softmax"
            }
          }
        ]
      }
    },
    "trainingConfig": {
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "learning_rate": 0.001
        }
      },
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"]
    },
    "weightsManifest": [
      {
        "paths": ["model-weights.bin"],
        "weights": [
          {
            "name": "conv2d_1/kernel",
            "shape": [3, 3, 1, 32],
            "dtype": "float32"
          },
          {
            "name": "conv2d_1/bias",
            "shape": [32],
            "dtype": "float32"
          },
          {
            "name": "conv2d_2/kernel",
            "shape": [3, 3, 32, 64],
            "dtype": "float32"
          },
          {
            "name": "conv2d_2/bias",
            "shape": [64],
            "dtype": "float32"
          },
          {
            "name": "dense_1/kernel",
            "shape": [3136, 128],
            "dtype": "float32"
          },
          {
            "name": "dense_1/bias",
            "shape": [128],
            "dtype": "float32"
          },
          {
            "name": "dense_2/kernel",
            "shape": [128, 10],
            "dtype": "float32"
          },
          {
            "name": "dense_2/bias",
            "shape": [10],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  